`  # aws_cloudwatch_metric_alarm.critical_dead_letter_queue will be created
  + resource "aws_cloudwatch_metric_alarm" "critical_dead_letter_queue" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-1:136195074491:secp-stable-service-critical-topic",
        ]
      + alarm_description                     = "This metric monitors the dead letter queue for the runtime."
      + alarm_name                            = "critical-stable-runtime-messages-in-dead-letter-queue"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "output-deadletter-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Maximum"
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }`